# Lý thuyết

In [24]:
import sqlite3

In [25]:
connection = sqlite3.connect('database.sqlite')

In [26]:
cursor = connection.cursor()

In [29]:
cursor.execute('''
    CREATE TABLE CUSTOMERS (
        EMAIL TEXT PRIMARY KEY,
        NAME TEXT NOT NULL,
        PHONE TEXT NOT NULL
    );
'''
)

In [30]:
cursor.execute('''
    INSERT INTO CUSTOMERS VALUES
               ('nguyen@aivietnam.edu.vn', 'Nguyen', '123456789'), 
               ('admin@aivietnam.edu.vn', 'Vinh', '1122334455')
'''
)
connection.commit()

In [31]:
import pandas as pd

In [32]:
data = pd.read_sql("SELECT * FROM CUSTOMERS", connection)
print(data)

                     EMAIL    NAME       PHONE
0  nguyen@aivietnam.edu.vn  Nguyen   123456789
1   admin@aivietnam.edu.vn    Vinh  1122334455

In [33]:
cursor.execute('''
UPDATE CUSTOMERS 
SET NAME = 'Hoang Nguyen'
WHERE 1 = 1
AND EMAIL = 'nguyen@aivietnam.edu.vn';
''')

connection.commit()

data = pd.read_sql_query('SELECT * FROM CUSTOMERS', connection)
print(data)

                     EMAIL          NAME       PHONE
0  nguyen@aivietnam.edu.vn  Hoang Nguyen   123456789
1   admin@aivietnam.edu.vn          Vinh  1122334455

In [34]:
cursor.execute('''
DELETE FROM CUSTOMERS 
WHERE 1 = 1
AND EMAIL = 'nguyen@aivietnam.edu.vn'
''')

In [35]:
connection.commit()

In [36]:
data = pd.read_sql_query("SELECT * FROM CUSTOMERS", connection)
print(data)

                    EMAIL  NAME       PHONE
0  admin@aivietnam.edu.vn  Vinh  1122334455

# Bài tập

In [37]:
connection = sqlite3.connect('exercise.sqlite')

In [38]:
cursor = connection.cursor()

In [40]:
cursor.execute(
'''
CREATE TABLE PRODUCT (
ID INTEGER PRIMARY KEY, 
NAME TEXT NOT NULL, 
PRICE INTEGER NOT NULL
)
'''
)

In [41]:
cursor.execute(
'''
SELECT * 
FROM PRODUCT
'''
)

In [44]:
cursor.execute(
'''
INSERT INTO PRODUCT (ID, NAME, PRICE)
VALUES
(1, 'iPhone 15', 18000000), 
(2, 'Galaxy Z-Fold 5', 30000000);
'''
)
connection.commit()

In [46]:
data = pd.read_sql_query('SELECT * FROM PRODUCT', connection)
print(data)

   ID             NAME     PRICE
0   1        iPhone 15  18000000
1   2  Galaxy Z-Fold 5  30000000

In [47]:
cursor.execute(
'''
UPDATE PRODUCT 
SET PRICE = 50000000
WHERE 1 = 1 AND
NAME = 'Galaxy Z-Fold 5'
'''
)
connection.commit()

data = pd.read_sql_query('SELECT * FROM PRODUCT', connection)
print(data)

   ID             NAME     PRICE
0   1        iPhone 15  18000000
1   2  Galaxy Z-Fold 5  50000000

In [48]:
cursor.execute(
'''
DELETE FROM PRODUCT 
WHERE 1 = 1 AND
NAME = 'iPhone 15'
'''
)
connection.commit()

data = pd.read_sql_query('SELECT * FROM PRODUCT', connection)
print(data)

   ID             NAME     PRICE
0   2  Galaxy Z-Fold 5  50000000